import i18n from 'i18next';
import { initReactI18next } from 'react-i18next';

const resources = {
  ja: {
    translation: {
      title: "西宮市障害児通所支援事業所",
      filters: "絞り込み",
      type: "種別",
      acceptedChildren: "現に受入を行っている児童",
      initiatives: "取組内容等",
      openMap: "地図を開く",
      close: "閉じる",
      noData: "データが見つかりません",
      all: "すべて",
      language: "言語",
      
      // Fields
      "事業所名": "事業所名",
      "中学校区": "中学校区",
      "住所": "住所",
      "電話番号": "電話番号",
      "メールアドレス": "メールアドレス",
      "ホームページ": "ホームページ",
      "種別": "種別",
      "1歳未満": "1歳未満",
      "～2歳児": "～2歳児",
      "3～5歳児": "3～5歳児",
      "小学生": "小学生",
      "中学生": "中学生",
      "高校生等": "高校生等",
      "重症心身障害児の受入": "重症心身障害児の受入",
      "医療的ケア児の受入": "医療的ケア児の受入",
      "利用時は保護者同伴": "利用時は保護者同伴",
      "送迎の実施": "送迎の実施",
      "月": "月",
      "火": "火",
      "水": "水",
      "木": "木",
      "金": "金",
      "土": "土",
      "日": "日",
      "祝": "祝",
      "集団療育": "集団療育",
      "個別療育": "個別療育",
      "ソーシャルスキル": "ソーシャルスキル",
      "運動訓練": "運動訓練",
      "言語訓練": "言語訓練",
      "学習支援": "学習支援",
      "その他": "その他",
      "「その他」の内容": "「その他」の内容",
      "備考": "備考",
      
      // Values (Types)
      "放デイ": "放デイ",
      "児発": "児発",
      "放デイ・児発": "放デイ・児発"
    }
  },
  zh: {
    translation: {
      title: "西宫市残疾儿童走读支援机构",
      filters: "筛选",
      type: "机构类型",
      acceptedChildren: "现接收儿童",
      initiatives: "举措内容等",
      openMap: "打开地图",
      close: "关闭",
      noData: "未找到数据",
      all: "全部",
      language: "语言",
      
      // Fields
      "事業所名": "机构名称",
      "中学校区": "初中学区",
      "住所": "地址",
      "電話番号": "电话号码",
      "メールアドレス": "电子邮箱",
      "ホームページ": "主页",
      "種別": "机构类型",
      "1歳未満": "1岁以下",
      "～2歳児": "~2岁儿童",
      "3～5歳児": "3~5岁儿童",
      "小学生": "小学生",
      "中学生": "初中生",
      "高校生等": "高中生等",
      "重症心身障害児の受入": "接收重症身心障碍儿童",
      "医療的ケア児の受入": "接收需医疗护理儿童",
      "利用時は保護者同伴": "利用时需监护人陪同",
      "送迎の実施": "提供接送",
      "月": "周一",
      "火": "周二",
      "水": "周三",
      "木": "周四",
      "金": "周五",
      "土": "周六",
      "日": "周日",
      "祝": "节假日",
      "集団療育": "集体疗育",
      "個別療育": "个别疗育",
      "ソーシャルスキル": "社交技能",
      "運動訓練": "运动训练",
      "言語訓練": "语言训练",
      "学習支援": "学习支援",
      "その他": "其他",
      "「その他」の内容": "“其他”内容",
      "備考": "备注",

      // Values (Types)
      "放デイ": "课后等日间服务 (放デイ)",
      "児発": "儿童发育支援 (児発)",
      "放デイ・児発": "日间服务及发育支援"
    }
  }
};

i18n
  .use(initReactI18next)
  .init({
    resources,
    lng: "ja", // default language
    fallbackLng: "ja",
    interpolation: {
      escapeValue: false
    }
  });

export default i18n;
